Revit 2024 API
IFCAnyHandle.SetAttribute Method (String, Boolean)
 Sets the attribute value.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void SetAttribute(
	string name,
	bool value
)
Visual Basic
Public Sub SetAttribute ( _
	name As String, _
	value As Boolean _
)
Visual C++
public:
void SetAttribute(
	String^ name,
	bool value
)
Parameters
name
Type: System.String
 The attribute name.
value
Type: System.Boolean
 The value.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
IFCAnyHandle Class
SetAttribute Overload
Autodesk.Revit.DB.IFC Namespace